{
  "backend/main.mo": "Main backend actor handling access control, user profiles, and post creation with visibility rules using storage and Stripe integrations.",
  "backend/migration.mo": "Migration module converting old actor state to new format by adding an empty subscriptions map.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files describing their purpose and functionality.",
  "frontend/index.css": "Global Tailwind-based styles defining color variables for light/dark themes and base styling rules.",
  "frontend/index.html": "HTML entry point with metadata, PWA configuration, icons, and root element mounting the React app.",
  "frontend/public/.ic-assets.json5": "IC asset configuration defining caching rules and MIME types for static files.",
  "frontend/public/404.html": "Redirect page storing the original path in sessionStorage before routing back to the SPA entry point.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, colors, icons, and startup behavior.",
  "frontend/public/sw.js": "Service worker implementing precaching, runtime caching, and offline fallback behavior for the app.",
  "frontend/PUBLISHING.md": "Guide describing prerequisites and steps for deploying the frontend app to the Internet Computer.",
  "frontend/src/App.tsx": "Sets up the root app with theme, router, and routes for feed, post detail, new post, and pricing, including redirect-handling on load.",
  "frontend/src/components/auth/AuthStatus.tsx": "Shows the logged-in user's name or abbreviated principal if authenticated.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication with loading states and error recovery.",
  "frontend/src/components/layout/AppHeader.tsx": "Top navigation bar with logo, pricing link, PWA install button, auth status, and login/logout.",
  "frontend/src/components/layout/AppLayout.tsx": "Page layout wrapper adding header, footer, offline notice, and profile setup modal around main content.",
  "frontend/src/components/posts/ImageCropper.tsx": "Interactive image cropper allowing drag-to-adjust crop area and producing a cropped blob.",
  "frontend/src/components/posts/ImageZoomViewer.tsx": "Modal viewer with zoom, pan, and reset controls for inspecting images.",
  "frontend/src/components/posts/PostCard.tsx": "Displays a writing post preview with image, metadata, and navigation to the post's detail page.",
  "frontend/src/components/posts/PostVisibilityBadge.tsx": "Renders a badge for private or link-only post visibility.",
  "frontend/src/components/posts/WritingTypeBadge.tsx": "Shows a badge indicating whether a post is poetry or prose.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Prompts new authenticated users without a profile to enter and save their name.",
  "frontend/src/components/pwa/InstallAppButton.tsx": "Provides a PWA install button that triggers the install prompt or shows fallback instructions when unavailable.",
  "frontend/src/components/pwa/OfflineNotice.tsx": "Shows a fixed offline alert when the browser loses network connectivity.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for posts, user profiles, subscriptions, and Stripe checkout actions using the backend actor.",
  "frontend/src/index.css": "Global Tailwind-based styling including theme variables, typography, textures, and layout utility classes.",
  "frontend/src/lib/imageCrop.ts": "Utility to crop an image file using canvas and return the cropped result as a Blob.",
  "frontend/src/lib/imageUpload.ts": "Converts a file to an ExternalBlob with optional progress reporting.",
  "frontend/src/lib/postPresentation.ts": "Formats author principals and post timestamps into human-readable strings.",
  "frontend/src/lib/seo.ts": "Helpers for dynamically setting the document title and meta description.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider and renders the root component.",
  "frontend/src/pages/FeedPage.tsx": "Fetches and displays all posts in a grid with loading state, SEO setup, and navigation to create a new post.",
  "frontend/src/pages/NewPostPage.tsx": "Provides a form for creating a new post with image upload, cropping, validation, and submission via createPost.",
  "frontend/src/pages/PostDetailPage.tsx": "Loads and displays a single post with metadata, image zoom, error handling, and dynamic SEO updates.",
  "frontend/src/pages/PricingPage.tsx": "Renders subscription plans and handles Stripe checkout creation, return verification, and subscription state management.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker, checks for updates, and logs status or errors.",
  "frontend/src/utils/urlParams.ts": "Utility functions for retrieving, clearing, and persisting URL parameters across both query and hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugins for the frontend UI.",
  "project_state.json": "Defines the project’s state metadata, a detailed summary of the app’s architecture and features, and a list of existing features with their IDs, descriptions, and versions."
}