{
  "backend/main.mo": "Main backend canister implementing access-controlled user profiles and post creation with visibility levels, storing posts and exposing queries for public or permitted access.",
  "feature_evidence.json": "Feature evidence report linking regeneration preview functionality to affected files and components.",
  "frontend-file-summaries.txt": "JSON-style list summarizing all frontend files and components, describing their roles in routing, UI, and functionality.",
  "frontend/index.css": "Tailwind base styles with OKLCH color variables and dark mode theme definitions.",
  "frontend/index.html": "Main HTML entry point defining meta tags, icons, manifest, and the root mounting element.",
  "frontend/public/.ic-assets.json5": "Asset canister configuration setting cache headers, routing behavior, and raw access rules.",
  "frontend/public/404.html": "Redirect shim capturing the original path and forwarding to the SPA entry point.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, colors, and display mode.",
  "frontend/public/sw.js": "Service worker providing caching, offline shell support, and network-first navigation handling.",
  "frontend/PUBLISHING.md": "Documentation explaining deployment, preview regeneration, and PWA installation steps for the app.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, theme provider, and main layout, defining routes for feed, post detail, new post, and pricing pages.",
  "frontend/src/components/auth/AuthStatus.tsx": "Displays the logged‑in user's name or shortened principal using Internet Identity and profile query data.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity with loading states and query cache clearing on logout.",
  "frontend/src/components/layout/AppHeader.tsx": "Renders the top navigation bar with logo, pricing link, install button, auth status, and login controls.",
  "frontend/src/components/layout/AppLayout.tsx": "Wraps the app with header, footer, offline notice, and global profile-setup modal around page content.",
  "frontend/src/components/posts/ImageCropper.tsx": "Allows users to drag and crop an uploaded image and returns a cropped blob via canvas processing.",
  "frontend/src/components/posts/ImageZoomViewer.tsx": "Provides a modal viewer with zoom, pan, and reset controls for viewing images at high resolution.",
  "frontend/src/components/posts/PostCard.tsx": "Displays a writing post preview with image, badges, title, message snippet, and navigation to the post page.",
  "frontend/src/components/posts/PostVisibilityBadge.tsx": "Shows a badge indicating whether a post is private or link‑only, hiding for public posts.",
  "frontend/src/components/posts/WritingTypeBadge.tsx": "Renders a badge showing whether a post is poetry or prose using appropriate icons.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Prompts new authenticated users to enter their name and saves the profile via mutation before continuing.",
  "frontend/src/components/pwa/InstallAppButton.tsx": "Provides a PWA install button that triggers the beforeinstallprompt when available and shows manual install instructions as fallback.",
  "frontend/src/components/pwa/OfflineNotice.tsx": "Displays an alert when the user is offline by listening to online/offline events.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s Internet Identity, invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider for loading, logging in, and managing user identities via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating posts and user profiles using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode styles, and custom utilities like paper textures and manuscript frames.",
  "frontend/src/lib/imageCrop.ts": "Crops an image file using canvas based on given coordinates and returns the result as a Blob.",
  "frontend/src/lib/imageUpload.ts": "Converts an image file to an ExternalBlob with optional progress tracking using FileReader.",
  "frontend/src/lib/postPresentation.ts": "Provides helpers to format author principals and human-readable timestamps for posts.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/FeedPage.tsx": "Displays the feed of posts, handles loading state, and shows a grid of PostCards with a button to create new posts.",
  "frontend/src/pages/NewPostPage.tsx": "Provides a form for creating a new post with image upload, cropping, validation, and submission.",
  "frontend/src/pages/PostDetailPage.tsx": "Shows a single post’s details with badges, author info, image zooming, and error handling for missing or private posts.",
  "frontend/src/pages/PricingPage.tsx": "Renders subscription plan cards with pricing, features, and a subscribe button.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers a service worker, handles update detection, and periodically checks for new versions.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Tailwind configuration defining typography, colors, animations, and extended theme settings.",
  "project_state.json": "Defines the project’s high-level state including app description, schema/versioning, and a list of existing features with IDs, titles, synonyms, descriptions, and versions. Serves as a structured inventory of implemented frontend and backend capabilities for the React/IC PWA."
}