{
  "kind": "build_request",
  "title": "Tighten Stripe checkout confirmation and subscription activation",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the backend subscription logic so that subscription status is based on successful Stripe checkout verification rather than the caller’s authenticated role.\n\n- Track per-principal subscription activation in backend state (e.g., a map keyed by Principal).\n- When `getStripeSessionStatus(sessionId)` is called and the session is verified as successfully completed/paid, mark the owning principal as subscribed (idempotently).\n- Update `isUserSubscribed()` to return the stored Stripe-backed subscription state for the caller (defaulting to false when no active subscription is recorded).\n- Preserve existing authorization checks so only the session owner (or an admin) can verify a session.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "YES PLS DO IT"
        ]
      },
      "acceptanceCriteria": [
        "If a user completes Stripe Checkout and returns with a valid `session_id`, calling `getStripeSessionStatus(sessionId)` records the user as subscribed in backend state.",
        "`isUserSubscribed()` returns true only after the backend has observed a successful Stripe session verification for that caller, and returns false otherwise.",
        "`getStripeSessionStatus(sessionId)` remains restricted to the session owner (or admin) and fails for other callers.",
        "Re-verifying the same successful session does not error and does not create inconsistent state (idempotent behavior)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Improve the Pricing page post-checkout confirmation UX to make verification explicit, resilient, and user-friendly.\n\n- On redirect back to `/pricing?success=true&session_id=...`, show a clear in-page “Verifying your subscription…” state (disable plan buttons while verifying).\n- Automatically verify the session via `useVerifyCheckoutSession`.\n- If verification fails with a transient error, provide a visible “Try again” action and keep the `session_id` available until verification succeeds or the user dismisses the flow.\n- Ensure URL parameters used for return handling are cleaned up appropriately to avoid repeated toasts/verification on refresh (including handling `canceled=true`).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "YES PLS DO IT"
        ]
      },
      "acceptanceCriteria": [
        "When landing on Pricing with `success=true&session_id=...`, the UI enters a verifying state and triggers verification without additional user action.",
        "While verifying, the subscription buttons are disabled and a loading indicator/message is visible.",
        "On verification success, the user sees a success message and the return parameters are removed from the URL without a full page reload.",
        "On cancellation (`canceled=true`), the user sees a cancellation message and `canceled` is removed from the URL without a full page reload.",
        "On verification error, the UI presents a retry control that re-attempts verification."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Reflect verified subscription status in the Pricing UI.\n\n- After successful verification, refresh and display the user’s current subscription status using the existing React Query subscription status query.\n- If the user is subscribed, indicate that in the Pricing page and prevent initiating a new checkout session from the plan buttons (or clearly label the buttons as unavailable).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "YES PLS DO IT"
        ]
      },
      "acceptanceCriteria": [
        "After a successful verification, the subscription status query is invalidated/refetched and returns `true` for the subscribed user.",
        "When subscribed, the Pricing page clearly indicates the active subscription state and does not allow starting a new checkout session from the plan buttons."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Do not edit files under `frontend/src/components/ui`, `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, or `frontend/src/main.tsx` (compose existing components/hooks instead).",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Implementing stable-memory persistence for subscription state across canister upgrades.",
    "Adding new payment providers or third-party authentication methods.",
    "Building a full customer portal (manage/cancel subscription in-app)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}