{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Tighten Pricing post-checkout verification UX and subscribed-state gating",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Make Pricing page explicitly verify Stripe return sessions with a resilient, retryable in-page flow and clean URL params without reload.",
      "acceptanceCriteria": [
        "When landing on Pricing with `success=true&session_id=...`, the UI enters a verifying state and triggers verification without additional user action.",
        "While verifying, the subscription buttons are disabled and a loading indicator/message is visible.",
        "On verification success, the user sees a success message and the return parameters are removed from the URL without a full page reload.",
        "On cancellation (`canceled=true`), the user sees a cancellation message and `canceled` is removed from the URL without a full page reload.",
        "On verification error, the UI presents a retry control that re-attempts verification."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/urlParams.ts",
          "operation": "modify",
          "description": "Add missing URL cleanup helpers used by Pricing: export a `clearUrlParameter` (and/or a small helper that clears multiple params) that removes query parameters via `window.history.replaceState` (and supports hash-query if present), so `/pricing?success=...&session_id=...` and `/pricing?canceled=true` can be cleaned without a full page reload."
        },
        {
          "path": "frontend/src/pages/PricingPage.tsx",
          "operation": "modify",
          "description": "Implement an explicit in-page post-checkout verification panel: when `success=true`, read and persist `session_id` (keep it available for retries even after URL cleanup), enter a “Verifying your subscription…” state, disable plan buttons while verifying, and automatically call `useVerifyCheckoutSession`. On transient verification error, show a visible “Try again” action that re-attempts verification using the persisted `session_id`, and provide a dismiss action that clears the persisted session and exits the flow. Handle `canceled=true` by showing a cancellation message and cleaning `canceled` from the URL via replaceState (no reload). Ensure all user-facing text is English."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Show verified subscription status on Pricing and prevent starting a new checkout when already subscribed; refresh status after successful verification.",
      "acceptanceCriteria": [
        "After a successful verification, the subscription status query is invalidated/refetched and returns `true` for the subscribed user.",
        "When subscribed, the Pricing page clearly indicates the active subscription state and does not allow starting a new checkout session from the plan buttons."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure the subscription status React Query invalidation/refetch is aligned with the existing subscription status query key (e.g., invalidate the exact `['subscription','status']` key used by `useIsUserSubscribed`, or keep prefix invalidation but verify it triggers refetch). This keeps Pricing status accurate immediately after `useVerifyCheckoutSession` succeeds."
        },
        {
          "path": "frontend/src/pages/PricingPage.tsx",
          "operation": "modify",
          "description": "Wire `useIsUserSubscribed` into the Pricing UI: show a clear 'active subscription' indicator when subscribed, and prevent initiating a new checkout session by disabling plan buttons (and guarding `handleSubscribe`) when `isSubscribed === true`. After successful session verification, rely on the existing subscription status query to refresh (via invalidation) and reflect the subscribed state."
        }
      ]
    }
  ]
}